ext_alsav/InformationRegisters/алсав_ПроверкаВнешнихФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>алсав_ПроверкаВнешнихФайлов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПроверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСвойства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФайлНайден</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерФайлаМегаБайты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипСправочника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектацииНоменклатуры</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяСвойства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ext_alsav/InformationRegisters/ДополнительныеСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДополнительныеСведения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ext_alsav/InformationRegisters/алсав_ПроверкаВнешнихФайлов/Ext/ManagerModule.bsl
Функция ВыполнитьПроверкиПоВсем()ЭКСПОРТ
	ВыполнитьПроверки("ХарактеристикиНоменклатуры","Файл сметы");
	ВыполнитьПроверки("Номенклатура","Файл сметы");
	ВыполнитьПроверки("ВариантыКомплектацииНоменклатуры","Файл сметы");
	
	ВыполнитьПроверки("ХарактеристикиНоменклатуры","Файл модели");
	ВыполнитьПроверки("Номенклатура","Файл модели");
	ВыполнитьПроверки("ВариантыКомплектацииНоменклатуры","Файл модели");
КонецФУнкции


Функция ВыполнитьПроверки(типСправочника ,имяСвойства, объект = неопределено)ЭКСПОРТ
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Т.Объект КАК Объект,
	               |	Т.ИмяСвойства КАК ИмяСвойства,
	               |	Т.ЗначениеСвойства КАК ЗначениеСвойства
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		дс.Ссылка.Ссылка КАК Объект,
	               |		дс.Свойство.Заголовок КАК ИмяСвойства,
	               |		дс.Значение КАК ЗначениеСвойства
	               |	ИЗ
	               |		Справочник.Номенклатура.ДополнительныеРеквизиты КАК дс) КАК Т";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"Справочник.Номенклатура.ДополнительныеРеквизиты","Справочник."+типСправочника+".ДополнительныеРеквизиты");
	Если  типСправочника = "ВариантыКомплектацииНоменклатуры" Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	Т.Объект КАК Объект,
		               |	Т.ИмяСвойства КАК ИмяСвойства,
		               |	Т.ЗначениеСвойства КАК ЗначениеСвойства
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		дс.Объект КАК Объект,
		               |		дс.Свойство.Заголовок КАК ИмяСвойства,
		               |		дс.Значение КАК ЗначениеСвойства
		               |	ИЗ
		               |		РегистрСведений.ДополнительныеСведения КАК дс) КАК Т";
	КонецЕсли;
	
	
	Запрос.Текст = Запрос.Текст +"
	| ГДЕ Т.ИмяСвойства = &имяСвойства";
	Если (объект <> неопределено) и ЗначениеЗаполнено(объект) Тогда
		Запрос.Текст = Запрос.Текст +"
			| И Т.Объект = &объект";
		Запрос.УстановитьПараметр("объект",объект);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("имяСвойства",имяСвойства);
	
	
	выборка = Запрос.Выполнить().Выбрать();
	Пока выборка.Следующий() Цикл
		запись = РегистрыСведений.алсав_ПроверкаВнешнихФайлов.СоздатьМенеджерЗаписи();
		
		запись.ТипСправочника = типСправочника;
		запись.Объект = выборка.Объект;
		запись.ИмяСвойства = имяСвойства;
		
		запись.ДатаПроверки = ТекущаяДата();
		запись.ЗначениеСвойства = выборка.ЗначениеСвойства;
		
		данныеОФайле = ПолучитьДанныеФайла(выборка.ЗначениеСвойства);
		ЗаполнитьЗначенияСвойств(запись, данныеОФайле);
		
		запись.Записать(ИСТИНА);
	КонецЦикла;
	
КонецФункции

Функция ПолучитьДанныеФайла(_полныйПуть)
	
	полныйПуть = _полныйПуть;
	полныйПуть = СтрЗаменить(полныйПуть,"\\","/mnt/");
	полныйПуть = СтрЗаменить(полныйПуть,"\","/");
	
	ВыбФайл = Новый Файл(полныйПуть);
	
	результ = новый Структура();
	
	результ.Вставить("ФайлНайден",ВыбФайл.Существует());
	размерФайла = 0.0;
	Если результ.ФайлНайден Тогда
		размерФайла = ВыбФайл.Размер() / 1024 / 1024;
	КонецЕсли;	
	результ.Вставить("РазмерФайлаМегаБайты",размерФайла);
	
	Возврат результ;
КонецФункции
